БИТУправление_медицинским_центром_демо/src/Documents/ПриемЗаказаИзМастерской/ПриемЗаказаИзМастерской.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемЗаказаИзМастерской</name>
  <comment>Прием из внешней мастерской</comment>
  <basedOn>Document.ПередачаЗаказаВМастерскую</basedOn>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccumulationRegister.МатериалыВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаСотрудников</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПередачаЗаказаВМастерскую</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DefinedType.КомплексныйРасчетКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ПриемЗаказаИзМастерской/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	ЗаполнитьДокументНастройкамиМастераПоУмолчаниюСервер();
	НастроитьВидимостьЭлементов();
	
	ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	УправлениеЗаказами.УстановитьУсловноеОформлениеЭтапамРабот(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Формирование списка выполенных этапов работ
	ВыполненныеЭтапы = КомплексныеРасчетыКлиентовСервер.ПолучитьВыполненныхЭтаповРаботИзТаблицы(ЭтапыРабот);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ВыполненныеЭтапыРабот", ВыполненныеЭтапы);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект.Ссылка, Ложь, ЭтаФорма);	
	ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененСтатусЗаказа", Объект.Заказ);
	Оповестить("ИзмененыЭтапыРаботЗаказа", Объект.Заказ, Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	
	ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененыЭтапыРаботЗаказа" И 
		Параметр = Объект.Заказ И Источник <> Объект.Ссылка 
	Тогда
		ЗаполнитьЭтапыРаботСОтметкамиВыполнения();	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНастройкамиМастераПоУмолчаниюСервер()
	док = РеквизитФормыВЗначение("Объект");
	док.ЗаполнитьДокументНастройкамиМастераПоУмолчанию();
	ЗначениеВРеквизитФормы(док, "Объект");
КонецПроцедуры

&НаСервере
Процедура НастроитьВидимостьЭлементов()
	
	Элементы.МатериалыХарактеристикаНоменклатуры.Видимость = мУчетнаяПолитика.ВестиУчетПоХарактеристикам;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНормам(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Материалы.Количество() <> 0 Тогда
		ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, );
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПоНормамСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоНормамСервер()
	
	Документы.ПриемЗаказаИзМастерской.ЗаполнитьМатериалыПоНормам(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) И ЗначениеЗаполнено(ТекущиеДанные.ЕдиницаИзмерения)
		Тогда
		ТекущиеДанные.Коэффициент = ДопСерверныеФункции.ПолучитьРеквизит(ТекущиеДанные.ЕдиницаИзмерения, "Коэффициент");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТД = Элементы.Материалы.ТекущиеДанные;
	ТД.Сумма = ТД.Количество * ТД.Цена;	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТД = Элементы.Материалы.ТекущиеДанные;
	ТД.Сумма = ТД.Количество * ТД.Цена;
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

#Область ЭтапыРабот

&НаСервере
Процедура ЗаполнитьЭтапыРаботСОтметкамиВыполнения()
	
	КомплексныеРасчетыКлиентовСервер.ЗаполнитьЭтапыРаботСОтметкамиВыполнения(Объект.Заказ, ЭтапыРабот, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботВыполненПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭтапыРабот.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КомплексныеРасчетыКлиентовКлиент.ЭтапыРаботВыполненПриИзменении(ТекДанные);
	Если ТекДанные.ОтметкаВыполнения И ТекДанные.ВнешнийИсполнитель И ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ТекДанные.ИсполнительФакт = Объект.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботОтметкаВыполненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭтапыРабот.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КомплексныеРасчетыКлиентовКлиент.ЭтапыРаботОтметкаВыполненияПриИзменении(ТекДанные);
	Если ТекДанные.ОтметкаВыполнения И ТекДанные.ВнешнийИсполнитель И ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		ТекДанные.ИсполнительФакт = Объект.Контрагент;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = ЭтапыРабот.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ЭтапыРаботДокументРегистратор Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.ДокументРегистратор) Тогда 
			ОткрытьЗначение(ТекДанные.ДокументРегистратор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
